Repository: cagatayergun/universal_scada_v
Catalog: TekstilScada.Core/Localization/SharedResource.*.resx
Languages: tr

# AlarmDuzenleBaslik
source: Edit Alarm
tr: Alarm Düzenle

# YeniAlarmBaslik
source: Add New Alarm
tr: Yeni Alarm Ekle

# AlarmNo
source: Alarm Number
tr: Alarm Numarası

# AlarmMetni
source: Alarm Text
tr: Alarm Metni

# MakineTipi
source: Machine Type
tr: Makine Tipi

# Kaydet
source: Save
tr: Kaydet

# Iptal
source: Cancel
tr: İptal

# Sil
source: Delete
tr: Sil

# AlarmSilOnay
source: Are you sure you want to delete this alarm?
tr: Bu alarmı silmek istediğinize emin misiniz?

# AlarmTanimlariBaslik
source: Alarm Definitions
tr: Alarm Tanımları

# YeniAlarmEkle
source: Add New Alarm
tr: Yeni Alarm Ekle

# AlarmlarYukleniyor
source: Loading alarms...
tr: Alarmlar yükleniyor...

# AlarmMesaji
source: Alarm Message
tr: Alarm Mesajı

# Onem
source: Severity
tr: Önem

# Islemler
source: Actions
tr: İşlemler

# Duzenle
source: Edit
tr: Düzenle

# AlarmSilSoru
source: Delete Alarm No: {0}?
tr: Alarm No: {0} silinsin mi?

# Hata
source: Error
tr: Hata

# SistemAyarlari
source: System Settings
tr: Sistem Ayarları

# MakineYonetimi
source: Machine Management
tr: Makine Yönetimi

# KullaniciYonetimi
source: User Management
tr: Kullanıcı Yönetimi

# AlarmTanimlari
source: Alarm Definitions
tr: Alarm Tanımları

# MaliyetYonetimi
source: Cost Management
tr: Maliyet Yönetimi

# PlcOperatorleri
source: PLC Operators
tr: PLC Operatörleri

# ReceteTasarimcisi
source: Recipe Designer
tr: Reçete Tasarımcısı

# VerilerYukleniyor
source: Loading data and establishing SignalR connection...
tr: Veriler yükleniyor ve SignalR bağlantısı kuruluyor...

# ToplamMakine
source: TOTAL MACHINES
tr: TOPLAM MAKİNE

# AktifMakine
source: ACTIVE MACHINES
tr: AKTİF MAKİNE

# AlarmdakiMakine
source: MACHINES IN ALARM
tr: ALARMDAKİ MAKİNE

# BekleyenMakine
source: IDLE MACHINES
tr: BEKLEYEN MAKİNE

# MakineTanimlanmamis
source: No machines defined in the system yet.
tr: Sistemde henüz makine tanımlanmamıştır.

# VeriBekleniyor
source: Waiting for data...
tr: Veri bekleniyor...

# ReceteGonderBaslik
source: Send Recipe (PC -> Machine)
tr: Reçete Gönder (PC -> Makine)

# Adim1ReceteSecimi
source: Step 1: Select Recipe
tr: 1. Adım: Reçete Seçimi

# ReceteTipi
source: Recipe Type
tr: Reçete Tipi

# ReceteSecildiCount
source: {0} recipes selected.
tr: {0} reçete seçildi.

# Adim2HedefSecimi
source: Step 2: Select Target
tr: 2. Adım: Hedef Seçimi

# MakineAdi
source: Machine Name
tr: Makine Adı

# HedefNo
source: Target No
tr: Hedef No

# HedefBaslangicNo
source: Target Start Slot:
tr: Hedef Başlangıç No:

# GonderimiBaslat
source: START TRANSFER
tr: GÖNDERİMİ BAŞLAT

# ReceteAlBaslik
source: Receive Recipe (Machine -> PC)
tr: Reçete Al (Makine -> PC)

# KaynakSecimi
source: Source Selection
tr: Kaynak Seçimi

# MakineSeciniz
source: Select Machine
tr: Makine Seçiniz

# HafizaOkunuyor
source: Reading memory...
tr: Hafıza okunuyor...

# HmiReceteleri
source: HMI Recipes (PLC)
tr: HMI Reçeteleri (PLC)

# ReceteAdi
source: Recipe Name
tr: Reçete Adı

# Secilen
source: Selected
tr: Seçilen

# Adet
source: items
tr: adet

# Indir
source: DOWNLOAD
tr: İNDİR

# IslemKuyrugu
source: Job Queue
tr: İşlem Kuyruğu

# KuyrukBos
source: Queue is empty
tr: Kuyruk boş

# IslemlerSuruyor
source: Processing...
tr: İşlemler sürüyor...

# Kapat
source: Close
tr: Kapat

# PlcReceteBulunamadi
source: No recipe name found in PLC.
tr: PLC'de kayıtlı reçete ismi bulunamadı.

# ReceteListesiAlinamadi
source: Failed to get recipe list
tr: Reçete listesi alınamadı

# ReceteIndirmeKuyrugaEklendi
source: recipes added to download queue.
tr: reçete indirme kuyruğuna eklendi.

# MakineOfflineOnay
source: {0} machines are OFFLINE. Continue anyway?
tr: {0} makine OFFLINE. Yine de eklensin mi?

# LimitAsildi
source: limit exceeded!
tr: limit aşıldı!

# KuyrugaAlindi
source: Queued.
tr: Kuyruğa alındı.

# MakineFiltreleme
source: Machine Filtering
tr: Makine Filtreleme

# MakineListesiYuklenemedi
source: Could not load machine list.
tr: Makine listesi yüklenemedi.

# Filtrele
source: Filter
tr: Filtrele

# TumunuSec
source: Select All
tr: Tümünü Seç

# SecimiTemizle
source: Clear Selection
tr: Seçimi Temizle

# FiltreSonucuYok
source: No machines found matching the filter.
tr: Filtreleme sonucunda gösterilecek makine bulunamadı.

# OeeVerisiYok
source: No OEE Data...
tr: OEE Verisi Yok...

# GenelBakis
source: Overview
tr: Genel Bakış

# GenelMakineDurumu
source: General Machine Status
tr: Genel Makine Durumu

# VeriBekleniyorDetay
source: Waiting for data from machines... (Ensure WebAPI project is running)
tr: Makinelerden veri bekleniyor... (WebAPI projesinin çalıştığından emin olun)

# YeniKullanici
source: New User
tr: Yeni Kullanıcı

# AdSoyad
source: Full Name
tr: Ad Soyad

# KullaniciAdi
source: Username
tr: Kullanıcı Adı

# Durum
source: Status
tr: Durum

# Aktif
source: Active
tr: Aktif

# Pasif
source: Passive
tr: Pasif

# Yukleniyor
source: Loading...
tr: Yükleniyor...

# KullaniciSilOnay
source: Delete {0}?
tr: {0} silinsin mi?

# KurutmaParametreleri
source: Drying Parameters
tr: Kurutma Parametreleri

# SicaklikC
source: Temperature (°C):
tr: Sıcaklık (°C):

# NemYuzde
source: Moisture (%):
tr: Nem (%):

# SureDk
source: Time (min):
tr: Süre (dk):

# CalismaDevriRpm
source: Working Speed (rpm):
tr: Çalışma Devri (rpm):

# SogutmaSuresiDk
source: Cooling Time (min):
tr: Soğutma Süresi (dk):

# GirisYapBaslik
source: Sign In
tr: Giriş Yap

# KullaniciAdiLabel
source: Username
tr: Kullanıcı Adı

# SifreLabel
source: Password
tr: Şifre

# GirisBasarisizHata
source: Login failed. Please check your username and password.
tr: Giriş başarısız. Lütfen kullanıcı adı ve şifrenizi kontrol edin.

# GirisButon
source: Sign In
tr: Giriş Yap

# Detaylar
source: Details
tr: Detaylar

# VncIzle
source: Watch Screen (VNC)
tr: Ekranı İzle (VNC)

# Bagli
source: Connected
tr: Bağlı

# Baglaniyor
source: Connecting...
tr: Bağlanıyor...

# BaglantiYok
source: No Connection
tr: Bağlantı Yok

# BaglantiKoptu
source: DISCONNECTED
tr: KOPUK

# Durakladi
source: PAUSED
tr: DURAKLADI

# Calisiyor
source: RUNNING
tr: ÇALIŞIYOR

# Bosta
source: IDLE
tr: BOŞTA

# Ilerleme
source: Progress
tr: İlerleme

# Recete
source: Recipe:
tr: Reçete:

# Parti
source: Batch:
tr: Parti:

# Adim
source: Step:
tr: Adım:

# Sicaklik
source: Temperature
tr: Sıcaklık

# Devir
source: Speed (RPM)
tr: Devir (RPM)

# YeniMakineEkleBaslik
source: Add New Machine
tr: Yeni Makine Ekle

# MakineDuzenleBaslik
source: Edit Machine
tr: Makine Düzenle

# GenelBilgiler
source: General Information
tr: Genel Bilgiler

# MakineAdiLabel
source: Machine Name:
tr: Makine Adı:

# MakineIdLabel
source: Machine ID (Short Code):
tr: Makine ID (Kısa Kod):

# MakineTipiLabel
source: Machine Type:
tr: Makine Tipi:

# Seciniz
source: Select...
tr: Seçiniz...

# BoyaMakinesi
source: Dyeing Machine
tr: Boya Makinesi

# KurutmaMakinesi
source: Drying Machine
tr: Kurutma Makinesi

# MakineAltTipiLabel
source: Machine Sub-Type (For Recipe Design):
tr: Makine Alt Tipi (Reçete Tasarımı İçin):

# MakineAltTipiPlaceholder
source: Ex: Yilmak_100kg
tr: Örn: Yilmak_100kg

# MakineAltTipiInfo
source: This field is used for filtering in the recipe design screen.
tr: Bu alan reçete tasarım ekranında filtreleme için kullanılır.

# BaglantiAyarlari
source: Connection Settings
tr: Bağlantı Ayarları

# IpAdresiLabel
source: IP Address:
tr: IP Adresi:

# FtpVncAyarlari
source: FTP & VNC Settings
tr: FTP & VNC Ayarları

# FtpKullaniciAdiLabel
source: FTP Username:
tr: FTP Kullanıcı Adı:

# FtpSifresiLabel
source: FTP Password:
tr: FTP Şifresi:

# VncAdresiLabel
source: VNC Address (Optional):
tr: VNC Adresi (Opsiyonel):

# VncSifresiLabel
source: VNC Password:
tr: VNC Şifresi:

# MakineAktifLabel
source: Machine Active
tr: Makine Aktif

# MakineDetayPageTitle
source: Machine Detail: {0} - {1}
tr: Makine Detay: {0} - {1}

# MakineDurumuYukleniyor
source: Loading machine status or Machine ID: {0} not found...
tr: Makine durumu yükleniyor veya Makine ID: {0} bulunamadı...

# MakineDetayiBaslik
source: {0} ({1}) Detail
tr: {0} ({1}) Detayı

# BaglantiDurumu
source: Connection Status
tr: Bağlantı Durumu

# UretimDurumu
source: Production Status
tr: Üretim Durumu

# ProsesYuzdesi
source: Process Percentage
tr: Proses Yüzdesi

# AktifAlarmBaslik
source: Active Alarm
tr: Aktif Alarm

# AlarmYok
source: No Alarm
tr: Alarm Yok

# AnlikDegerler
source: Instant Values
tr: Anlık Değerler

# OperatorLabel
source: OPERATOR
tr: OPERATÖR

# MusteriNoLabel
source: CUSTOMER NO
tr: MÜŞTERİ NO

# SiparisNoLabel
source: ORDER NO
tr: SİPARİŞ NO

# SuSeviyesiLabel
source: WATER LEVEL
tr: SU SEVİYESİ

# AktifAdimLabel
source: ACTIVE STEP
tr: AKTİF ADIM

# PlcReceteAdimlari
source: Recipe Steps Read from PLC
tr: PLC'den Okunan Reçete Adımları

# ReceteAdimlariOkunuyor
source: Reading recipe steps from PLC...
tr: Reçete adımları PLC'den okunuyor...

# AktifAdimBulunamadi
source: Active recipe step not found on machine or no defined step.
tr: Makinede aktif reçete adımı bulunamadı veya tanımlı adım mevcut değil.

# AdimSutun
source: Step
tr: Adım

# AciklamaSutun
source: Description
tr: Açıklama

# TanimsizAdim
source: Undefined Step
tr: Tanımsız Adım

# AlarmGecmisiTab
source: Alarm History
tr: Alarm Geçmişi

# TrendAnaliziTab
source: Trend Analysis (Temp/Water/Speed)
tr: Trend Analizi (Sıcaklık/Su/Devir)

# AktifAlarmDurumu
source: Active Alarm Status
tr: Aktif Alarm Durumu

# AktifAlarmLabel
source: Active Alarm:
tr: Aktif Alarm:

# AktifAlarmYok
source: No Active Alarm.
tr: Aktif Alarm Yok.

# BaglantiBekleniyorAlarm
source: Waiting for connection... Cannot check active alarm status.
tr: Bağlantı bekleniyor... Aktif alarm durumu kontrol edilemiyor.

# AlarmGecmisiBaslik
source: Alarm History (Last 30 Days)
tr: Alarm Geçmişi (Son 30 Gün)

# AlarmGecmisiYukleniyor
source: Loading alarm history...
tr: Alarm geçmişi yükleniyor...

# GecmisAlarmYok
source: No past alarm records found for this machine.
tr: Bu makine için geçmiş alarm kaydı bulunamadı.

# BaslangicZamani
source: Start Time
tr: Başlangıç Zamanı

# AlarmKodu
source: Alarm Code
tr: Alarm Kodu

# Aciklama
source: Description
tr: Açıklama

# Sure
source: Duration
tr: Süre

# TrendVerileriYukleniyor
source: Loading trend data...
tr: Trend verileri yükleniyor...

# TrendVerisiYok
source: No trend data found for the last 100 minutes.
tr: Son 100 dakika için trend verisi bulunamadı.

# CanliTrendGrafigi
source: Live Process Trend Chart
tr: Canlı Proses Trend Grafiği

# CanliTrendAnalizi
source: Live Process Trend Analysis
tr: Canlı Proses Trend Analizi

# AdimTipi_SuAlma
source: Water Intake
tr: Su Alma

# AdimTipi_Isitma
source: Heating
tr: Isıtma

# AdimTipi_Calisma
source: Running
tr: Çalışma

# AdimTipi_Dozaj
source: Dosing
tr: Dozaj

# AdimTipi_Bosaltma
source: Drain
tr: Boşaltma

# AdimTipi_Sikma
source: Spin
tr: Sıkma

# MakineYonetimiBaslik
source: Machine Management
tr: Makine Yönetimi

# YeniMakineEkleButon
source: Add New Machine
tr: Yeni Makine Ekle

# MakinelerYukleniyor
source: Loading machines...
tr: Makineler yükleniyor...

# IpAdresi
source: IP Address
tr: IP Adresi

# Tipi
source: Type
tr: Tipi

# VeriYuklemeHatasi
source: Data loading error
tr: Veri yükleme hatası

# KaydetmeHatasi
source: Saving error
tr: Kaydetme hatası

# MakineSilOnay
source: Are you sure you want to delete machine '{0}'?
tr: '{0}' makinesini silmek istediğinizden emin misiniz?

# SilmeHatasi
source: Deletion error
tr: Silme hatası

# MaliyetParametreleriBaslik
source: Cost Parameters
tr: Maliyet Parametreleri

# DegisiklikleriKaydet
source: Save Changes
tr: Değişiklikleri Kaydet

# SistemParaBirimi
source: System Currency:
tr: Sistem Para Birimi:

# SistemParaBirimiInfo
source: This currency will be used in all reports.
tr: Bu para birimi tüm raporlarda kullanılacaktır.

# ParametreAdi
source: Parameter Name
tr: Parametre Adı

# BirimMaliyet
source: Unit Cost
tr: Birim Maliyet

# Birim
source: Unit
tr: Birim

# CarpanKatsayi
source: Multiplier (Coefficient)
tr: Çarpan (Katsayı)

# MaliyetAyarlariKaydedildi
source: Cost settings saved successfully.
tr: Maliyet ayarları başarıyla kaydedildi.

# OperatorDuzenleBaslik
source: Edit Operator
tr: Operatör Düzenle

# PlcKoduBilgi
source: These settings are templates that will be written directly to the PLC.
tr: Bu ayarlar doğrudan PLC'ye yazılacak şablonlardır.

# OperatorAdi
source: Operator Name
tr: Operatör Adı:

# KullaniciIdSayisal
source: User ID (Numeric):
tr: Kullanıcı ID (Sayısal):

# SifreSayisal
source: Password (Numeric):
tr: Şifre (Sayısal):

# PlcOperatorYonetimiBaslik
source: PLC Operator Management
tr: PLC Operatör Yönetimi

# VarsayilanEkle
source: Add Default
tr: Varsayılan Ekle

# KullaniciId
source: User ID
tr: Kullanıcı ID

# Sifre
source: Password
tr: Şifre

# OperatorSilOnay
source: Delete operator '{0}'?
tr: '{0}' operatörü silinsin mi?

# ProsesKontrolBaslik
source: Process Control
tr: Proses Kontrol

# RecetelerBaslik
source: Recipes
tr: Reçeteler

# HedefMakineFiltre
source: Target Machine (Filter)
tr: Hedef Makine (Filtre)

# TumuSeciniz
source: All / Select
tr: Tümü / Seçiniz

# Yeni
source: New
tr: Yeni

# Yenile
source: Refresh
tr: Yenile

# DuzenlemekIcinReceteSecin
source: Select a recipe to edit
tr: Düzenlemek için bir reçete seçin

# FtpSenkronizasyonMerkezi
source: FTP SYNCHRONIZATION CENTER
tr: FTP SENKRONİZASYON MERKEZİ

# IslemlerMenu
source: ACTIONS
tr: İŞLEMLER

# SeciliMakineyeGonder
source: Send to Selected Machine
tr: Seçili Makineye Gönder

# SeciliMakinedenOku
source: Read from Selected Machine
tr: Seçili Makineden Oku

# FtpCokluGonderim
source: FTP / Multi Send
tr: FTP / Çoklu Gönderim

# AdimlarBaslik
source: STEPS
tr: ADIMLAR

# AdimSecUyari
source: Select a step from the left to edit.
tr: Düzenlemek için soldan bir adım seçiniz.

# VerilerYuklenmediUyari
source: Data not loaded yet, please wait.
tr: Veriler henüz yüklenmedi, lütfen bekleyin.

# OnceMakineSecinUyari
source: Please select a target machine first.
tr: Lütfen önce hedef makineyi seçin.

# YeniReceteVarsayilanAd
source: NEW RECIPE
tr: YENİ REÇETE

# YeniReceteOlusturuldu
source: New recipe created.
tr: Yeni reçete oluşturuldu.

# ReceteDetaylariYukleniyor
source: Loading recipe details...
tr: Reçete detayları yükleniyor...

# ReceteAdiBosOlamaz
source: Recipe name cannot be empty.
tr: Reçete adı boş olamaz.

# ReceteTipiEslesmiyorHata
source: ERROR: Recipe type ({0}) does not match selected machine type ({1}). Please create a new recipe or change the machine type.
tr: HATA: Reçete tipi ({0}) seçili makine tipiyle ({1}) eşleşmiyor. Lütfen yeni bir reçete oluşturun veya makine tipini değiştirin.

# ReceteKaydediliyor
source: Saving recipe...
tr: Reçete kaydediliyor...

# ReceteBasariylaKaydedildi
source: Recipe saved successfully.
tr: Reçete başarıyla kaydedildi.

# KaydetmeBasarisizApi
source: Save failed. API error.
tr: Kaydetme başarısız oldu. API hatası.

# ReceteSilOnay
source: Are you sure you want to delete recipe '{0}'? This action cannot be undone.
tr: '{0}' reçetesini silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.

# ReceteSiliniyor
source: Deleting recipe...
tr: Reçete siliniyor...

# ReceteBasariylaSilindi
source: Recipe deleted successfully.
tr: Reçete başarıyla silindi.

# SilmeBasarisizApi
source: Delete failed. API error.
tr: Silme başarısız oldu. API hatası.

# HmiReceteNoGiriniz
source: Enter HMI Recipe Number (1-99):
tr: HMI Reçete Numarası Giriniz (1-99):

# ReceteGonderiliyor
source: Sending recipe to machine '{0}'...
tr: Reçete '{0}' makinesine gönderiliyor...

# GonderimBasarili
source: Transfer Successful!
tr: Gönderim Başarılı!

# ReceteOkunuyor
source: Reading recipe from machine '{0}'...
tr: Reçete '{0}' makinesinden okunuyor...

# ReceteBasariylaOkundu
source: Recipe successfully read from machine. Rename and save it.
tr: Reçete makineden başarıyla okundu. Yeni bir isim verip kaydedin.

# PlcOkumaBasarisiz
source: Reading from PLC failed. Connection/PLC error.
tr: PLC'den okuma başarısız oldu. Bağlantı/PLC hatası.

# OkumaHatasi
source: Error reading
tr: Okuma sırasında hata

# BilesenlerYukleniyor
source: Loading components...
tr: Bileşenler yükleniyor...

# ReceteAdimTasarimcisiBaslik
source: Recipe Step Designer
tr: Reçete Adım Tasarımcısı

# TasarimiKaydet
source: Save Layout
tr: Tasarımı Kaydet

# MakineAltTipi
source: Machine Sub-Type:
tr: Makine Alt Tipi:

# AdimTipi
source: Step Type:
tr: Adım Tipi:

# Kontroller
source: Controls
tr: Kontroller

# Ekle
source: Add
tr: Ekle

# EtiketLabel
source: Label
tr: Etiket (Label)

# SayisalNumeric
source: Numeric (NumericUpDown)
tr: Sayısal (Numeric)

# OnayKutusuCheckbox
source: Checkbox
tr: Onay Kutusu (Checkbox)

# MetinKutusuTextBox
source: TextBox
tr: Metin Kutusu (TextBox)

# Tur
source: Type
tr: Tür

# MetinIsim
source: Text / Name
tr: Metin / İsim

# KonumXY
source: Position (X,Y)
tr: Konum (X,Y)

# PlcAdres
source: PLC Address
tr: PLC Adres

# Islem
source: Action
tr: İşlem

# Ozellikler
source: Properties
tr: Özellikler

# GorunenMetin
source: Display Text:
tr: Görünen Metin (Text):

# XKonumu
source: X Position:
tr: X Konumu:

# YKonumu
source: Y Position:
tr: Y Konumu:

# PlcAyarlari
source: PLC Settings
tr: PLC Ayarları

# AdresWord
source: Address (Word):
tr: Adres (Word):

# MaxDeger
source: Max Value:
tr: Max Değer:

# OndalikVirgul
source: Decimal Places:
tr: Ondalık (Virgül):

# UzunlukWord
source: Length (Word):
tr: Uzunluk (Word):

# GorselOnizleme
source: Visual Preview
tr: Görsel Önizleme

# DuzenlemekIcinKontrolSec
source: Select a control from the list to edit.
tr: Düzenlemek için listeden bir kontrol seçin.

# DuzenlemekIcinAdimTipiSec
source: Please select a Step Type to edit.
tr: Lütfen düzenlemek için bir Adım Tipi seçin.

# BasariylaKaydedildi
source: Saved successfully!
tr: Başarıyla kaydedildi!

# HataOlustu
source: Error Occurred:
tr: Hata Oluştu:

# KurutmaAdimiSabit
source: This step belongs to a drying machine. The editor structure is static.
tr: Bu adım kurutma makinesine aittir. Editör yapısı statiktir.

# AdimTipleri
source: Step Types
tr: Adım Tipleri

# AdimSecimiGecersiz
source: A maximum of 2 different process types can be selected, or Spin/Drain steps cannot be selected together with other standard steps.
tr: En fazla 2 farklı işlem türü seçilebilir veya Sıkma/Boşaltma adımları diğer standart adımlarla bir arada seçilemez.

# KontrolVerisiYuklemeHatasi
source: Error loading control data from API
tr: Kontrol verisi API'den yüklenirken hata oluştu

# BilesenYuklemeHatasi
source: A critical error occurred while loading the component
tr: Bileşen yüklenirken kritik bir hata oluştu

# ServisKayitHatasi
source: Critical Error: ScadaDataService is not registered in 'Program.cs' (Dependency Injection error).
tr: Kritik Hata: ScadaDataService servisi 'Program.cs' içinde kayıtlı değil (Dependency Injection hatası).

# JsonIslemeHatasi
source: API JSON could not be processed (Step ID {0})
tr: API'den gelen JSON işlenemedi (Step ID {0})

# DegerDegistirmeHatasi
source: Error occurred while changing value
tr: Değer değiştirilirken hata oluştu

# KontrolRenderHatasi
source: Error rendering control '{0}'
tr: Kontrol '{0}' render edilirken hata oluştu

# KontrolYuklenemedi
source: Control could not be loaded
tr: Kontrol yüklenemedi

# YeniKullaniciBaslik
source: New User
tr: Yeni Kullanıcı

# KullaniciDuzenleBaslik
source: Edit User
tr: Kullanıcı Düzenle

# SifreDegismezseBos
source: (Leave blank if not changing)
tr: (Değişmeyecekse boş bırakın)

# RollerLabel
source: Roles:
tr: Roller:

# RollerYuklenemedi
source: Roles could not be loaded.
tr: Roller yüklenemedi.

# AktifKullaniciLabel
source: Active User
tr: Aktif Kullanıcı

# UzaktanErisim
source: Remote Access:
tr: Uzaktan Erişim:

# BaglantiyiKes
source: Disconnect
tr: Bağlantıyı Kes

# MakineBilgileriYukleniyor
source: Loading machine information...
tr: Makine bilgileri yükleniyor...

# BaglaniyorNokta
source: Connecting...
tr: Bağlanıyor...

# IsEmriBekliyor
source: Machine waiting for work order
tr: Makine iş emri bekliyor

# BaglantiYokKisa
source: No Connection
tr: Bağlantı Yok

# AnlikDetaylar
source: Instant Details
tr: Anlık Detaylar

# TemelBilgiler
source: Basic Information
tr: Temel Bilgiler

# ProsesBilgileri
source: Process Information
tr: Proses Bilgileri

# AlarmVar
source: Alarm Active:
tr: Alarm Var:

# CalismaSuresi
source: Running Time:
tr: Çalışma Süresi:

# Dk
source: min
tr: dk

# Evet
source: YES
tr: EVET

# Hayir
source: NO
tr: HAYIR

# TamProsesKontrolu
source: Full Process Control
tr: Tam Proses Kontrolü

# NavMenu_ProsesIzleme
source: Process Monitoring
tr: Proses İzleme

# NavMenu_ProsesKontrol
source: Process Control
tr: Proses Kontrol

# NavMenu_Raporlar
source: Reports
tr: Raporlar

# NavMenu_Ayarlar
source: Settings
tr: Ayarlar

# CikisYap
source: Sign Out
tr: Çıkış Yap

# GirisYap
source: Sign In
tr: Giriş Yap

# RaporlarBaslik
source: Reports
tr: Raporlar

# UretimRaporuTab
source: Production Report
tr: Üretim Raporu

# GecmisAlarmlarTab
source: Past Alarms
tr: Geçmiş Alarmlar

# OeeRaporuTab
source: OEE Report
tr: OEE Raporu

# TrendAnaliziTabRaporlar
source: Trend Analysis
tr: Trend Analizi

# ReceteTuketimAnaliziTab
source: Recipe Consumption Analysis
tr: Reçete Tüketim Analizi

# ManuelTuketimTab
source: Manual Consumption
tr: Manuel Tüketim

# GenelTuketimRaporuTab
source: General Consumption Report
tr: Genel Tüketim Raporu

# EylemKayitlariTab
source: Action Logs
tr: Eylem Kayıtları

# TarihAraligiLabel
source: Date Range
tr: Tarih Aralığı

# BaslangicBitisPlaceholder
source: Start - End
tr: Başlangıç - Bitiş

# MakineLabel
source: Machine
tr: Makine

# TumMakineler
source: ALL MACHINES
tr: TÜM MAKİNELER

# ReceteAdiAraPlaceholder
source: Recipe Name
tr: Reçete Adı

# DetayliFiltrelerPanel
source: Detailed Filters (Batch, Order, Operator)
tr: Detaylı Filtreler (Batch, Sipariş, Operatör)

# Hesaplaniyor
source: CALCULATING...
tr: HESAPLANIYOR...

# RaporlaButon
source: REPORT
tr: RAPORLA

# ExcelIndirButon
source: DOWNLOAD EXCEL
tr: EXCEL İNDİR

# UretimSonuclariBaslik
source: Production Results
tr: Üretim Sonuçları

# TablodaAraPlaceholder
source: Search in Table (Batch, Recipe, Operator...)
tr: Tabloda Ara (Batch, Reçete, Operatör...)

# VerilerAnalizEdiliyor
source: Analyzing data, please wait...
tr: Veriler analiz ediliyor, lütfen bekleyin...

# KriterlereUygunKayitYok
source: No records found matching the criteria.
tr: Seçilen kriterlere uygun kayıt bulunamadı.

# AlarmGecmisiBaslikRaporlar
source: Alarm History
tr: Alarm Geçmişi

# AlarmAraPlaceholder
source: Search Alarm (No, Description...)
tr: Alarm Ara (No, Açıklama...)

# OeeAnaliziBaslik
source: OEE Analysis
tr: OEE Analizi

# AraGenelPlaceholder
source: Search (Machine, Batch...)
tr: Ara (Makine, Batch...)

# KullanilabilirlikLabel
source: Availability (A)
tr: Kullanılabilirlik (A)

# PerformansLabel
source: Performance (P)
tr: Performans (P)

# KaliteLabel
source: Quality (Q)
tr: Kalite (Q)

# AnalizAraligiLabel
source: Analysis Range
tr: Analiz Aralığı

# MakineSecimiLabel
source: Select Machine
tr: Makine Seçimi

# MakineSecinizPlaceholder
source: Select Machine
tr: Makine Seçiniz

# AnalizEdiliyor
source: ANALYZING...
tr: ANALİZ EDİLİYOR...

# TrendiCizButon
source: PLOT TREND
tr: TRENDİ ÇİZ

# VerilerIsleniyor
source: Processing data, please wait...
tr: Veriler işleniyor, lütfen bekleyin...

# IstatistikselOzetBaslik
source: Statistical Summary
tr: İstatistiksel Özet

# TrendVerisiYokTarih
source: No process data found for this date range.
tr: Bu tarih aralığında kayıtlı proses verisi bulunamadı.

# ReceteAraPlaceholder
source: Search Recipe...
tr: Reçete Ara...

# LutfenReceteSeciniz
source: Please select a recipe from the left.
tr: Lütfen soldan bir reçete seçiniz.

# GecmisUretimKaydiYok
source: No past production records found for the selected recipe.
tr: Seçilen reçete için geçmiş üretim kaydı bulunamadı.
