Repository: cagatayergun/universal_scada_v
Catalog: TekstilScada.Core/Localization/SharedResource.*.resx
Languages: tr

# OrtalamaSu
source: AVG WATER
tr: ORTALAMA SU

# OrtalamaElektrik
source: AVG ELECTRICITY
tr: ORTALAMA ELEKTRİK

# OrtalamaBuhar
source: AVG STEAM
tr: ORTALAMA BUHAR

# GecmisUretimlerBaslik
source: Past Productions
tr: Geçmiş Üretimler

# ManuelModOzet
source: Manual Mode Usage Summary
tr: Manuel Mod Kullanım Özeti

# RaporAraligi
source: Report Range:
tr: Rapor Aralığı:

# OrtalamaDevir
source: AVG SPEED
tr: ORTALAMA DEVİR

# ManuelKayitYok
source: No manual operation records found matching the criteria.
tr: Seçilen kriterlere uygun manuel çalışma kaydı bulunamadı.

# TuketimTipiLabel
source: Consumption Type
tr: Tüketim Tipi

# ElektrikKw
source: Electricity (kW)
tr: Elektrik (kW)

# SuLitre
source: Water (Liter)
tr: Su (Litre)

# BuharKg
source: Steam (kg)
tr: Buhar (kg)

# MakinelerCokluSecim
source: Machines (Multi Select)
tr: Makineler (Çoklu Seçim)

# DetayliTuketimRaporuBaslik
source: Detailed Consumption Report
tr: Detaylı Tüketim Raporu

# IslemDetayiArama
source: Action Detail (Partial Search)
tr: İşlem Detayı (Kısmi Arama)

# KullaniciHareketleriBaslik
source: User Actions
tr: Kullanıcı Hareketleri

# KayitlardaAraPlaceholder
source: Search Logs...
tr: Kayıtlarda Ara...

# Zaman
source: Time
tr: Zaman

# IslemTipi
source: Action Type
tr: İşlem Tipi

# AktarilacakVeriYok
source: No report data to export. Please generate the report first.
tr: Aktarılacak rapor verisi bulunmamaktadır. Lütfen önce rapor oluşturun.

# LutfenEnAzBirMakineSecin
source: Please select at least one machine.
tr: Lütfen en az bir makine seçin.

# Turkce
source: Turkish
tr: Türkçe

# Ingilizce
source: English
tr: İngilizce

# Dozaj
source: Dosage
tr: Dozaj

# Isıtma
source: Heating
tr: Isıtma

# Boşaltma
source: Drain
tr: Boşaltma

# Çalışma
source: Working
tr: Çalışma

# Sıkma
source: Squeezing
tr: Sıkma

# VncBaglantiReddedildi
source: Connection Refused
tr: Bağlantı Reddedildi

# VncBaskasiIzliyor
source: This machine is currently being viewed by '{0}'. For safety and performance, only one operator can connect at a time.
tr: Bu makine şu an '{0}' tarafından izleniyor. Güvenlik ve performans nedeniyle aynı anda sadece bir operatör bağlanabilir.

# GeriDon
source: Go Back
tr: Geri Dön

# AktifAlarmBaslikBanner
source: ACTIVE ALARM
tr: AKTİF ALARM

# AlarmBalonMesaji
source: Alarm occurred on machine {0}! Code: {1}
tr: {0} makinesinde alarm oluştu! Kod: {1}

# AlarmGiderildiMesaji
source: Alarm cleared on machine {0}.
tr: {0} makinesindeki alarm giderildi.
